Repository: B-Rich/idle-reimagined
Catalog: idlelib/locale/*/LC_MESSAGES/idlelib.po
Languages: es

source: Show Completions
es: Mostrar Terminaciones

source: E_xpand Word
es: E_xpandir Palabra

source: _New File
es: _Nuevo Archivo

source: _Open...
es: Abrir Archivo...

source: Open _Module...
es: Abrir _Módulo...

source: Class _Browser
es: Examinador de Clases

source: _Path Browser
es: Examinador de Ruta

source: _Save
es: Guardar

source: Save _As...
es: Guardar Como...

source: Save Cop_y As...
es: Guardar una Copia...

source: Prin_t Window
es: Imprimir

source: _Close
es: Cerrar

source: E_xit
es: Salir

source: _Undo
es: Deshacer

source: _Redo
es: Rehacer

source: Cu_t
es: Cor_tar

source: _Copy
es: _Copiar

source: _Paste
es: _Pegar

source: Select _All
es: Seleccionar Todo

source: _Find...
es: Buscar

source: Find A_gain
es: Buscar de Nuevo

source: Find _Selection
es: Buscar _Selección

source: Find in Files...
es: Buscar en los Archivos...

source: R_eplace...
es: Sustituir

source: Go to _Line
es: Ir a la _Línea

source: _Indent Region
es: Sangría

source: Comment _Out Region
es: Comentar Región

source: New Indent Width
es: Nueva Sangría Ancho

source: _View Last Restart
es: _Ver Último Reinicio

source: _Go to File/Line
es: Ir a la Archivos/Línea

source: !_Debugger
es: !_Depurador

source: _Stack Viewer
es: Visor de Pila

source: !_Auto-open Stack Viewer
es: !_Auto Espectador Pila Abierta

source: Configure _Extensions
es: Configurar _Extensiones

source: _About IDLE
es: _Acerca de IDLE

source: _IDLE Help
es: _IDLE Ayuda

source: Turtle Demo
es: Demostración de la Tortuga

source: Show call tip
es: Mostrar sugerencia de llamada

source: Class Browser -
es: Examinador de Clases -

source: !Code Conte_xt
es: !Conte_xto Código

source: Debug Control
es: Control de Depuración

source: Debug
es: Depurar

source: Go
es: Ir

source: Step
es: Paso

source: Over
es: Encima

source: Out
es: Fuera

source: Quit
es: Salir

source: Stack
es: Pila

source: Source
es: Fuente

source: Go to source line
es: Ir a la línea de la fuente

source: Show stack frame
es: Mostrar marco de pila

source: _File
es: Archivo

source: _Edit
es: _Editar

source: F_ormat
es: F_ormato

source: _Run
es: Ejecutar

source: _Options
es: _Opciones

source: _Windows
es: Ventanas

source: _Help
es: Ayuda

source: Recent Files
es: Archivos Recientes

source: Close
es: Cerrar

source: About IDLE
es: Acerca de IDLE

source: Settings
es: Configuración

source: Document Start Failure
es: Fracaso Inicio Documento

source: Module
es: Módulo

source: Enter the name of a Python module to search on sys.path and open:
es: Escriba el nombre de un módulo Python buscar en sys.path y abierto:

source: Import error
es: Error de importación

source: Module not found.
es: Módulo no encontrado.

source: Not a source-based module.
es: No es un módulo basado en la fuente.

source: Loader does not support get_filename.
es: Cargador no soporta get_filename.

source: Unable to update Recent Files list: %s
es: No se puede actualizar reciente lista de archivos: %s

source: Untitled
es: Sin título

source: File Error
es: Error de Archivo

source: %r is a directory.
es: %r es un directorio.

source: Name Conflict
es: Nombre de Conflictos

source: You now have multiple edit windows open for %r
es: Hay varias ventanas de edición abiertas para %r

source: Format Paragraph
es: Formato de Párrafo

source: Find in Files Dialog
es: Buscar en Archivos de Diálogo

source: In files:
es: En los archivos:

source: Search subfolders
es: Buscar en subcarpetas:

source: Search Files
es: Buscar archivos

source: Searching %r in %s ...
es: Buscando en %r %s ...

source: Results found: %s (Hint: right-click to open locations.)
es: Resultados encontrados: %s (Sugerencia: haga clic para abrir lugares.)

source: No results.
es: No hay resultados.

source: Decoding Error
es: Error al Decodificar

source: File %s Failed to Decode
es: %s del archivo Error al Decodificar

source: Error loading the file
es: Error al cargar el archivo

source: The encoding '%s' is not known to this Python installation. The file may not display correctly
es: La codificación '%s' no se conoce a esta instalación de Python. El archivo no se muestre correctamente

source: Specify file encoding
es: Especifique la codificación de archivos

source: The file's encoding is invalid for Python 3.x. IDLE will convert it to UTF-8. What is the current encoding of the file?
es: La codificación del archivo no es válido para Python 3.x. IDLE lo convertirá a UTF-8. Que es la actual codificación del archivo?

source: Do you want to save %s before closing?
es: ¿Quieres guardar %s antes de cerrar?

source: this untitled document
es: este documento sin título

source: Save On Close
es: Ahorre en Cerrar

source: I/O Error
es: Error de E/S

source: %s. Saving as UTF-8
es: %s. Almacenamiento como UTF-8

source: Print
es: Imprimir

source: Print to Default Printer
es: Impresora predeterminada

source: Printing failed (exit status 0x%x)
es: Impresión falló (estado de salida 0x%x)

source: Printing command: %s
es: Comando de impresión: %s

source: Print status
es: Imprimir estado

source: Printing is not enabled for this platform: %s
es: La impresión no está habilitado para esta plataforma: %s

source: Python files
es: Archivos de Python

source: Text files
es: Archivos de texto

source: All files
es: Todos los archivos

source: No special line
es: No hay línea especial

source: The line you point at doesn't look like a valid file name followed by a line number.
es: La línea que apunta a no se ve como un nombre de archivo válido seguido de un número de línea.

source: Path Browser
es: Examinador de Ruta

source: ** IDLE can't import Tkinter. Your Python may not be configured for Tk. **
es: ** IDLE no puede importar Tkinter. La Python no puede ser configurado para Tk. **

source: Cut
es: Cortar

source: Copy
es: Copiar

source: Paste
es: Pegar

source: Set Breakpoint
es: Definir Punto de Quiebre

source: Clear Breakpoint
es: Limpiar Punto de Quiebre

source: Exit
es: Salir

source: Do you want to exit IDLE?
es: ¿Desea salir IDLE?

source: Port Binding Error
es: Puerto Binding Error

source: IDLE can't bind to a TCP/IP port, which is necessary to communicate with its Python execution server. This might be because no networking is installed on this computer. Run IDLE with the -n command line switch to start without a subprocess and refer to Help/IDLE Help 'Running without a subprocess' for further details.
es: IDLE no se puede obligar a un puerto TCP / IP, que es necesaria para comunicarse con su servidor de ejecución de Python. Esto podría deberse a que hay redes está instalado en este equipo. Marcha en vacío con el modificador de línea de comandos -n para empezar sin un subproceso y consulte Ayuda / Ayuda IDLE 'Correr sin un subproceso' para más detalles.

source: Subprocess Startup Error
es: Subproceso Error en el inicio

source: IDLE's subprocess didn't make connection. Either IDLE can't start a subprocess or personal firewall software is blocking the connection.
es: Subproceso de IDLE no hizo conexión. De cualquier IDLE no se puede iniciar un subproceso o software de firewall personal está bloqueando la conexión.

source: Already executing
es: Ya ejecución

source: The Python Shell window is already executing a command; please wait until it is finished.
es: La ventana de Python Shell ya está ejecutando un comando; por favor espere hasta que esté terminado.

source: Can't Enable Debugger
es: No se puede habilitar el depurador

source: Debugger can only be enabled when not running a program.
es: Depurador sólo se puede activar cuando no se está ejecutando un programa.

source: Kill?
es: Matar?

source: Do you want to terminate the currently running program?
es: ¿Quieres terminar el programa en curso?

source: ==== No Subprocess ==== WARNING: Running IDLE without a Subprocess is deprecated and will be removed in a later version. See Help/IDLE Help for details.
es: ==== No Subproceso ==== Advertencia: marcha en vacío sin un subproceso está en desuso y se quitará en una versión posterior. Ver Ayuda/IDLE Ayuda por detalles

source: Python %s on %s %s %s
es: Python %s en %s %s %s

source: No stack trace
es: No traza de la pila

source: There is no stack trace yet. (sys.last_traceback is not defined)
es: No hay traza de la pila todavía. (sys,kast_traceback no está definido)

source: Replace Dialog
es: Reemplace diálogo

source: Replace
es: Sustituir

source: Invalid regular expression
es: Expresión regular incorrecta.

source: Strip trailing whitespace
es: Gaza espacios en blanco finales

source: Check Module
es: Compruebe Módulo

source: Run Module
es: Módulo Ejecutar

source: Tabnanny Tokenizing Error
es: Tabnanny Tokenización Error

source: Token Error: %s
es: Error simbólico: %s

source: Save Before Run or Check
es: Guardar Antes Ejecutar o Inspección

source: Find Next
es: Buscar siguiente

source: Search
es: Buscar

source: Options
es: Opciones

source: Regular expression
es: Expresión regular

source: Match case
es: Coincidir mayúsculas y minúsculas

source: Whole word
es: Toda la palabra

source: Wrap around
es: Envuelva alrededor

source: Direction
es: Dirección

source: Down
es: Abajo

source: Up
es: Arriba

source: Undo
es: Deshacer

source: Redo
es: Rehacer

source: Dump
es: Volcado de datos

source: Python's Integrated DeveLopment Environment
es: Entorno de DesarroLlo Integrado de Python

source: Python version:
es: Versión de Python:

source: Tk version:
es: Versión Tk:

source: License
es: Licencia

source: Copyright
es: Derechos de autor

source: Credits
es: Créditos

source: IDLE version:
es: Versión IDLE:

source: NEWS
es: NOTICIAS

source: About - License
es: Acerca de - Licencia

source: About - Copyright
es: Acerca de - Derechos de autor

source: About - Python Credits
es: Acerca de - Python Créditos

source: About - Credits
es: Acerca de - Créditos

source: About - Readme
es: Acerca de - Readme

source: About - NEWS
es: Acerca de - NOTICIAS

source: Menu Item:
es: Elemento del Menú:

source: Help File Path: Enter URL or browse for file
es: Ayuda Ruta del archivo: Introduzca el URL o busque el archivo

source: Browse
es: Explorar

source: OK
es: Aceptar

source: Cancel
es: Cancelar

source: HTML Files
es: Archivos HTML

source: PDF Files
es: Archivos PDF

source: Windows Help Files
es: Ayuda de Windows Archivos

source: Text Files
es: Archivos de Texto

source: All Files
es: Todos los Archivos

source: Menu Item Error
es: Error de Elemento de Menú

source: No menu item specified.
es: No elemento de menú especificado.

source: Menu item too long Limit 30 characters.
es: Elemento de menú demasiado largo El límite es de 30 caracteres.

source: File Path Error
es: Ruta Archivo Error

source: No help file path specified.
es: Ningún ruta archivo de ayuda especifica.

source: Help file path does not exist.
es: Ruta del archivo de ayuda no existe.

source: Name Error
es: Nombre Error

source: No name specified.
es: No se especifica un nombre.

source: Name too long. It should be no more than 30 characters.
es: Nombre demasiado largo. El límite es de 30 caracteres.

source: This name is already in use.
es: Este nombre ya está en uso.

source: Advanced Key Binding Entry >>
es: Advanced Key Entrada Encuadernación >>

source: New keys for %s :
es: Nuevas claves para %s:

source: Select the desired modifier keys above, and the final key from the list on the right. Use upper case Symbols when using the Shift modifier. (Letters will be converted automatically.)
es: Seleccione las teclas modificadoras deseados anteriores, y la clave final de la lista de la derecha. Utilice Símbolos mayúsculas cuando se utiliza el modificador Shift. (Las cartas se convierten automáticamente.)

source: Enter new binding(s) for %s : (These bindings will not be checked for validity!)
es: Introduzca nuevo enlace para %s: (Estos enlaces no se comprobará la validez!)

source: Key Sequence Error
es: Secuencia de teclas Error

source: No keys specified.
es: No hay claves especificadas.

source: Missing the final Key
es: Falta la clave final

source: No modifier key(s) specified.
es: No clave(s) modificador especificado.

source: The shift modifier by itself may not be used with this key symbol.
es: El modificador de cambio por sí mismo no se puede utilizar con este símbolo de llave.

source: This key combination is already in use.
es: Esta combinación de teclas ya está en uso.

source: WARNING: The version of Tcl/Tk ({0}) in use may be unstable. Visit http://www.python.org/download/mac/tcltk/ for current information.
es: ADVERTENCIA: La versión de Tcl / Tk ({0}) en uso puede ser inestable. Visita http://www.python.org/download/mac/tcltk/ para obtener información actualizada..

source: Help
es: Ayuda

source: _Preferences...
es: _Preferencias...

source: IDLE's subprocess can't connect to %s:%d. This may be due to your personal firewall configuration. It is safe to allow this internal connection because no data is visible on external ports.
es: Subproceso de IDLE no puede conectarse a %s:%d. Esto puede ser debido a la configuración del cortafuegos personal. Es seguro permitir esta conexión interna porque no hay datos visibles en los puertos externos.

source: IDLE Subprocess Error
es: IDLE Subproceso de error

source: File Load Error
es: Error al Cargar el Archivo

source: Unable to load file %r .
es: No se puede cargar el archivo %r .
